# 1. წლოვანების კალკულატორი: 

# დაწერეთ პროგრამა რომელიც მომხმარებელს სთხოვს მის დაბადების წელს და გამოითვლის მის წლოვანებას
# age = int(input("sheni dabadebis weli: "))
# print(2024 - age)
# 2. ოთკუთხედის ფართობი და პერიმეტრი: 

# შემიატანინეთ მომხმარებელს ოთკუთხედის სიგრზე და სიგანე საბოლოოდ კი გამოთვალეთ ამ ოთკუთხედის ფართობი და პერიმეტრი
# (
# ფართობი - a*b
# პერიმეტრი - 2*(a+b)
# )
# a = int(input("kvadratis sigrdze: "))
# b = int(input("kvadratis sigane: "))
# print(a * b)

# 3. სთხოვეთ მომხმარებელს შემოიტანოს მისი სახლიდან სკოლამდე მანძილი კილომეტრებში და დაუპრინტეთ თუ რა მანძილია მისი სახლიდან სკოლამდე მეტრებში,სანტიმეტრებში და მილიმეტრებში.
# km = int(input("sigrdze saxlidan skolamde: "))
# print(km * 0.001)
# print(km * 0.00001)
# print(km * 0.000001)

# 4. შემოატანინეთ მომხმარებელს მისი სახელი გვარი მშობლების სახელი გვარი საყვარელი ფერი საყვარელი მანქანა 3 საყვარელი ჰობი და ეს ყველაფერი დაბეჭდეთ ერთ დიდ წინადადებაში
# p1 = input("sheni saxeli: ")
# p2 = input("sheni gvari: ")
# p3 = input("Sheni msoblebis saxeli da gvari: ")
# p4 = input("sheni sayvareli color: ")
# p5 = input("sheni sayvareli mankana: ")
# p6 = input("sami sayvareli hobi: ")
# print(p1 + " " + p2 + " " + p3 + " " +  p4 + " " +  p5 + " " +  p6)

# 5. Extreme difficulty (თუ იცით ციკლები არ გამოიყენოთ ისინი)
# დაწერეთ პითონის პროგრამა, რომელიც სთხოვს მომხმარებელს ორნიშნა რიცხვს შემდეგ ამოიღებს ამ რიცხვიდან ციფრებს ინდივიდუალურად და დაბეჭდავს ამ ციფრების ჯამს.  (მინიშნება: გამოიყენეთ //, %)
