# 1)შექმენით, ცვლადი რომელიც მომხარებეს შეეკითხება თუ რამდენი წლის არი, მის მიხედვით დაპრინტოს საიტერაციო ცვლადის მნიშნველოებები
age = input("Please enter your age: ")

print(age)
# 2) შემოატანინეთ მომხარებელს, ტემპერატურა, და გადაიყანეთ ფარენჰეიტებში (ფორმულა ინტენრნეტშ მოიძიეთ)
C = int(input("enter C : "))
print((C * 9 // 5) + 32)
# 3) 3-3 მაგალთი დაწერეთ ლოგიგური და შედარების ოპერატორებზე 
print(90 > 25 or 73 < 2)
print(29 > 11 and 50 > 90)
print(222 > 111 or 20 < 80)
# 4) გააკეთეთ სამკუთხედი ფორ ლუპის გამოყენებთ <3  * -ეით

# 5) დაწერეთ ლოგკირუი ოპერატორით,  თუ მომხარებელი არის, 20 წლის (true)
age = int(input("Please enter your age: "))

print(age == 20)