# 1) დაწერეთ პროგრამა, რომელიც შეიცავს ორი რიცხვის (მაგალითად, a და b) ცვლადებს, მათ ჯამს, სხვაობას, ნამრავლს და განაყოფს. პროგრამამ უნდა დაბეჭდოს თითოეული მათგანი.
apple = 50
hummans = 100
print(hummans + apple)
print(hummans - apple)
print(hummans * apple)
print(hummans // apple)
# 2) შექმენით პროგრამა, რომელიც შეიცავს ორ ცვლადს – თქვენი სახელი და ასაკი. დაბეჭდეთ ეს ინფორმაცია შემდეგი ფორმატით: 'ჩემი სახელია [სახელი] და ვარ [ასაკი] წლის'.
name = "omar"
age  = 15
print("chemi saxelia  " + name + " da var " + str(age) + " wlis")
# 3) შექმენით ცვლადი, სახელად points, რომელიც თავიდან უდრის 50, შემდეგ დაა-update-ეთ ან ცვლადის მნიშვნელობა, რამოდენიმეჯერ. საბოლოოდ კი დაპრინტეთ ეს ცვლადი
points = 50
print(points)
print(points + 10)
print(points - 10)
# 4) შექმენით პროგრამა, რომელიც ითვლის თქვენი დაბადების წლიდან რამდენი წელია გასული დღემდე. (შექმენით ორი ცვლადი-birthyear და current_year)
birthyear = 2009
current_year = 2024
print(current_year - birthyear)
# 5) ახსენით ოთხივე დავალება კომენტარებით
#პირველ დავალებაში მე გავიყენე რამდენიმე ცვლადი მივეცი მნიშვნელობა და მათემატიკულად გამოვაკლე მიუმატე გავამრავლე და გავყავი
#მეორე დავალებაში მე გამოვიყენე ორი ცვლადი ერთს დავარქვი ჩემი სახელი მეორეს ჩემი ასაკი და პრინტში დავწერე და age დავუმატე სტრინგი რადგან ის იყო ინტეჯერი 
#მესამე დავალებაში ავიღე ერთი ცვლადი მივეცი მნიშვნელობა 50 და მივუმატე 10 და მეორეში 10 გამოვაკალი
#მეოთხე დავალებაში ავიღე ჩემი დაბადების წელი და ეხლანდელიი წელი და 2024 წელს გამოვაკალი 2009